000001*MI PRIMER PROGRAMA EN COBOL.
       000002 IDENTIFICATION DIVISION.
       000003 PROGRAM-ID. HolaMundo.
           
       ENVIROMENT DIVIDION.

       DATA DIVISION.

       PROCEDURE division.
       stop run.
