       program-id. Program2 as "HolaMundo.Program2".

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program Program2.