       class-id FormsCobol.Serpiente.

       working-storage section.

       method-id InstanceMethod.
       local-storage section.
       procedure division.

           goback.
       end method.

       end class.
